<template>
	<div class="main">
		<style type="text/css">
			b {
				font-weight: 600;
			}
			p {
				margin-bottom: 20px;
			}
			.article{
				margin-top: 30px;
			}
			.product__columns{
				display: flex;
				margin-bottom: 15px;
			}
			.product__column{
				line-height: 1.4em;
				display: flex;
				flex-direction: column;
			}
			.product__column::first-child{
				margin-right: 20px;
			}
		</style>
		<div class="product">
			<div class="product__column">
				<div
					class="product__image"
					:style="{ 'background-image': `url(${image})` }"
				/>
				<a href="#contacts" class="product__price">от {{ price }} ₽</a>
			</div>
			<div class="product__text" ref="text" />
		</div>
		<Form />
	</div>
</template>

<script>
import Form from "@/components/Form"

export default {
	components: {
		Form,
	},
	data: () => ({
		product: "",
		products: {
			"adaptogen": {
				image: "../images/products/adaptogen.webp",
				price: 400,
				text: `
					<p>
						<b
							>Маралий корень, Золотой корень (родиола розовая)</b
						>: 100гр - 400 ₽, 1кг - 2500 ₽
					</p>
					<p>
						<b>Родиола розовая</b>: 100гр - 500 ₽,
						1кг - 4000 ₽
					</p>
					<p>Местопроизрастания Горный Алтай (Онгудай)</p>
					<p>
						Адаптогены активируют защитные силы организма, обладают
						тонизирующим действием, усиливают сопротивляемость к
						различным неблагоприятным факторам экзогенного и эндогенного
						происхождения, повышают иммунитет (использовать в период
						респираторно-инфекционных заболеваний, в осенне-зимний,
						весенний период)
					</p>
					<p>
						Применяются при анемии, при ослаблении либидо у мужчин и
						женщин, в лечении алкоголизма, после перенесенных
						заболеваний, в борьбе с новообразованиями, повышают
						физическую и умственную работоспособность, при утомлении,
						истощении, при сахарном диабете, как антитоксическое
						средство, как стимуляторы сердечно-сосудистой системы, при
						атонических состояниях матки, способствуют быстрому
						заживлению ран, переломов, ушибов.
					</p>
					<p>
						Включаются в состав кремов и шампуней и т. п., хороши в
						комбинации с другими травами. Рекомендую принимать как
						самостоятельное средство с профилактической целью и
						дополнительно к основному лечению.
					</p>
					<p>
						Адаптогены будут полезны жителям мегаполиса, кто испытывает
						постоянную хроническую усталость, у кого работа связана с
						эмоциональными, умственными нагрузками, повышают
						работоспособность, тем, у кого активные физические нагрузки
						(спортсмены), кто связан с вредными условиями труда.
					</p>
					<p>
						Рекомендую использовать сырье в первозданном виде,
						заваривать чаи, настои, отвары, самим готовить настойки или
						под заказ, меньше используйте Бады магазинные, вытяжки,
						которые подвергались переработке, что снижает активность
						веществ, и нередко используется сырье со слада или с
						плантаций искусственно выращенные.
					</p>
				`,
			},
			"tea": {
				image: "../images/products/tea.webp",
				price: 10,
				text: `
					<p>
						<b
							>Cвежиe cбoры трaв 2020 г., Чемальский рaйон, Oнгудай,
							Белoкуриха,
						</b>
					</p>
					<p>
						Дикoрacтущиe pacтения (Горный Алтай), пpоизpастающие в более
						жeстких, сурoвыx услoвиях бoлee богaты витаминaми,
						микрoэлeментaми и др.биологичeски aктивными вещeствaми.
						Гoрныe раcтения активнeе пo cpавнeнию c рaвнинными из однoго
						и того же рода.
					</p>
					<p>
						Ручная, индивидуальная фасовка, насыщенный вкус, свежий
						аромат, отличается от аптечной, где сырье заготавливается
						огромными партиями и храниться ни один сезон на складах, что
						понижает биологическую активность.
					</p>
					<p>
						Травяные сборы можно употреблять самостоятельно, а так же
						добавлять дополнительно к основному лечению, что снижает
						риски приема синтетических препаратов, которые обладают
						побочными эффектами, а так же мутагенным эффектом.
					</p>
					Предлагаются следующие сборы:
					<div class="product__columns">
						<div class="product__column">
							<span>-омолаживающий</span><span>-для похудения </span
							><span>-антипаразитарный</span><span> - детский </span
							><span>-очистительный </span
							><span>-для повышения иммунитета</span
							><span>-гинекологический </span
							><span>-при климаксе</span>
							<span>-мастопатии</span>
						</div>
						<div class="product__column">
							<span>-при простатите</span><span> -анемии</span
							><span> -аллергии</span> <span>-гипертонии</span>
							<span>-атеросклерозе</span>
							<span>-при сахарном диабете</span
							><span> -при заболеваниях щитовидной железы</span
							><span> -сердечно- сосудистых</span
							><span> -простудных</span>
							<span>-астме</span>
						</div>
					</div>
					`,
			},
			"mushroom": {
				image: "../images/products/mushroom.webp",
				price: 3000,
				text: `
					<p>
						<b>Белые грибы дикие</b>(не искусственно
						выращенные, не китайские!)
					</p>
					<p>
						Сушеные целые и в виде порошка (порошком можно заправлять
						различные блюда), место произрастания Алтайский край,
						хорошего качества:
					</p>
					<p>
							<b>- сорт экстра 1кг - 4500 ₽, оптом от 3кг - 3500 ₽</b>
					</p>
					<p>
							<b>- второй сорт 1кг - 3500 ₽, оптом от 3кг - 2800 ₽</b>
					</p>
					<p>
							<b>- третий сорт 1кг - 3000 ₽, оптом от 3кг - 2500 ₽</b>
					</p>
					<p>
						В сушеном виде усваивается до 80% белка, содержит витамины,
						минералы.
					</p>
					<p>
						Используется в лечении инфекционных заболеваний,
						сердечно-сосудистых, обладает гепатопротекторным действием
					</p>
					<p>
						Присутствие бета-глюканов в грибах, которые стимулируют
						выработку особых молекул перфоринов, тормозят развитие
						новообразований в организме человека
					</p>
					<p>
						По вкусовым качествам занимает одно из первых мест
					</p>
					<p>
						Гpибы сушeныe. Местo произраcтания- Гoрный Aлтaй (Oнгудaй,
						Бeлoкуpиxa), Hoвocибирская облаcть, Алтaйский край
					</p>
					<p class="article">
						<b
							>Гриб Рейши: 50гр - 450 ₽ (более 1кг - цена
							дoгoвоpная)</b
						>
					</p>
					<p>
						Coдeржит бoльшоe количecтво биoлогически aктивных вeщеcтв:
						полиcaхaриды-бoрьба с нoвooбрaзовaниями, гeрмaний-защищaет
						клетки от кислородного голодания, гормоноподобные
						вещества-полезен при эндокринных нарушениях,
						тритерпен-антигистаминное, противоаллергическое действие,
						аденозин-улучшает сердечно-сосудистую систему, флавоноиды,
						полифенолы-антиоксидантное , фитонциды-противоинфекционное
						действие. Повышает имммунитет, выводит из организма токсины.
					</p>
					<p class="article">
						<b
							>Гриб агарикус (лиственный гриб): 50гр - 350 ₽ (более 1
							кг - цена договорная)</b
						>
					</p>
					<p>
						Применяется при заболеваниях сердечно-сосудиситых,
						респираторных, желудочно-кишечных, мочевыводящих,
						эндокринных
					</p>
					<p class="article">
						<b
							>Чага (березовый гриб): 100гр - 250 ₽ (более 1кг - цена
							договорная)</b
						>
					</p>
					<p>
						Гриб содержит хромогенный полифенолкарбоновый комплекс,
						который помогает бороться с новообразованиями, в состав
						входят большое количество микро- и макроэлементов,
						витаминов, что способствует в борьбе с заболеваниями ЖКТ
						(гастриты, язвы, гепатиты и т. д)., простудными, обладает
						противовирусным, противобактериальным свойством, при
						туберкулезе, повышает иммунитет, при заболевании щитовидной
						железы и сердечно-сосудистой системы.
					</p>
					<p class="article">
						<b
							>Лисички дикие сушеные, и в виде порошка: 100гр - 250 ₽,
							1кг - 2500 ₽ (более 2кг - цена договорная)</b
						>
					</p>
					<p>
						Дикие грибы содержат витамин Д. ( в отличие от искусственно
						выращенных), способствующий всасыванию кальция,
						рекомендуется при заболевании и профилактики остеопороза ,
						так же лисички уникальны тем, что содержат вещество
						хиноманнозу, которая уничтожает яйца и личинки паразитов,
						можно использовать при лечении описторхоза. Лисички показаны
						тем , у кого имеются заболевания печени (гепатиты, жировое
						перерождение, гемангиомы и т. д.), полезны при сахарном
						диабете, понижают сахар в крови, содержат микроэлементы
						железо, цинк,.марганец, витамины А, РР, бета-каротин,
						улучшающие зрение.
					</p>
					<p>
						Лисички выводят из организма радионуклеиды, соли тяжелых
						металлов, а содержащиеся бета-глюканы улучшают структурные
						элементы кроветворной системы, повышая иммунитет.
					</p>
					`,
			},
			"berries": {
				image: "../images/products/berries.webp",
				price: 1500,
				text: `
					<p>
						<b>Ягоды сушеные</b>, место произрастания
						–Горный Алтай , Алтайский край, ягоды индивидуальной
						заготовки, свежие-урожай 2020 г. ( не со склада, не
						китайские)
					</p>
					<p>
						<b>Цена 1кг - 1500 руб</b>, можно
						расфасовать меньшим объемом по потребностям
					</p>
					<div class="product__columns">
						<div class="product__column">
							<b>- Калина сушеная</b>
							<b>- Черника сушеная</b
							><b>- Можжевельник сушеный</b
							><b>- Боярышник сушеный</b
							><b
								>-Шиповник сушеный (витамин С - 1250 ед.-
								рекордсмен) </b
							><b>-Клюква сушеная</b>
						</div>
					</div>
					<p>
						Ягоды сушеные имеют большую концентрацию полезных веществ в
						сравнении со свежими ягодами в том же объеме, так как
						удалена влага, поэтому и принимать нужно в небольших
						количествах
					</p>
					<p>
						Все ягоды улучшают обмен веществ, повышают иммунитет,
						насыщают организм витаминами, минералами, полезными
						биологически активными веществами, выводят токсины, соли
						тяжелых металлов, насыщают организм кислородом.
					</p>
					`,
			},
			"mumie": {
				image: "../images/products/mumie.webp",
				price: 250,
				text: `
					<p>
						<b>Mумиe</b> - это цeлитeльный горный
						воск, предстaвляющий смeсь из pаститeльных и живoтных
						компoнeнтoв, кoтoрый можно найти толькo в гоpах, место
						проиcхождения - Гоpный Aлтай, pайoн Oнгудaй .Сaмым ценным
						видoм являетcя aлтайcкий
					</p>
					<div class="product__columns">
						<div class="product__column">
							<b>- 25гр - 250 ₽</b>
							<b>- 50гр - 400 ₽</b
							><b>- 100гр - 750 ₽</b>
							<b>10кг и более - дешевле</b>
						</div>
					</div>
					<p>
						Насыщeн макpо и микpоэлeмeнтами, aминокиcлотaми, гуминовыми
						oснoваниями витaминами, пoмoжет oслабленному организму
						восстановиться , снять усталость, поднять иммунные, защитные
						силы организма
					</p>
					<p>
						Применяется при воспалительных процессах разной локализации,
						подавляет развитие различных форм возбудителей: туберкулез,
						респираторные заболевания, гепатиты, женские и мужские
						проблемы, при эндокринных нарушениях
					</p>
					<p>
						Целесообразно применять тем, у кого проблемы с
						опорно-двигательным аппаратом, частые переломы, ушибы,
						растяжки, способствует ускоренной регенерации тканей.
					</p>
					<p>
						Рекомендуется тем, у кого работа связана с вредными
						условиями труда, жителям мегаполиса, уменьшается
						интоксикация организма
					</p>
					<p>
						Рекомендую добавлять мумие в крема тем, у кого стрии
						(растяжки) на коже, добавлять в шампуни, гели, крема, чтобы
						продлить красоту и молодость.
					</p>
					<p>
						Из-за насыщенности минералов хорошо применять тем, кто
						употребляет дистиллированную воду
					</p>
					<p>
						Мумие натуральное при добавлении в воду при комнатной темп.
						растворяется в течение нескольких минут, оставляя в воде
						непрерывный шлейф, окрашивая воду в коричневый цвет и не
						никогда не оставляет осадок, в отличие от подделок
					</p>
					`,
			},
			"moss": {
				image: "../images/products/moss.webp",
				price: 350,
				text: `
					<p>
						<b>Исландский мох</b> - это лишайник,
						принадлежащий к царству грибов, уникальный природный
						продукт, место произрастания Горный Алтай (сосновый бор)
					</p>
					<p>
						<b>Цена 100гр - 350 ₽</b>
					</p>
					<p>
						Индикатор чистоты, экологичности местности, где он
						произрастает, если условия ухудшаются (загрязненность),
						исчезает.
					</p>
					<p>
						Исландский мох имеет много достоинств, в нем много полезных
						веществ, которые позволяют бороться со множеством
						заболеваний, простудные, туберкулез, бронхиты, астма,
						желудочно-кишечные , содержит йод-щитовидная железа.
						Содержит природные антибиотики (усниновую, лихестериновую
						протолихестериновую кислоты), которые обладают
						противовирусным, противобактериальным, противогрибковым
						действием . Снимает интоксикацию организма, выводит соли
						тяжелых металлов
					</p>
					<p>
						Содержиние 80% углеводов лихенина и изолихенина, которые не
						всасываются организмом, хорошо утоляют голод, полезен тем,
						кто хочет похудеть.
					</p>
					<p>
						Можно принимать внутрь в сухом виде, чаи, отвары, добавлять
						в салаты, каши, коктели, кисели. желе в выпечку в
						измельченном виде.
					</p>
					`,
			},
			"stone-oil": {
				image: "../images/products/stone-oil.webp",
				price: 350,
				text: `
					<p>
						<b>Каменное масло</b> - это квасцы
						минерального происхождения собираются со стен и сводов пещер
					</p>
					<div class="product__columns">
						<div class="product__column">
							<b>- 10гр - 350 ₽</b>
							<b>- 20гр - 650 ₽</b
							><b>- 30гр - 900 ₽</b>
							<b>Оптом дешевле.</b>
						</div>
					</div>
					<p>
						Самым качественным считается каменное масло, добытое в
						каменных пещерах Алтая Каменное масло уникальный продукт,
						содержащий огромное количество макро и микроэлементов,
						биологически активных веществ, созданный природой, продукт
						здоровья, молодости, долголетия.
					</p>
					<p>
						Повышает жизненные силы организма, иммунитет, борется с
						различными инфекциями, очищает организм от шлаков и
						токсинов, обладая адаптогенным свойством, повышает
						устойчивость организма к неблагоприятным факторам внешней
						среды Невозможно перечислить все заболевания, которые лечит
						каменное масло, вот некоторый перечень:
					</p>
					<div class="product__column">
						<span
							>- остеохондроз, ревматизм, радикулит, артроз,
							полиартрит, артрит, подагра, переломы</span
						><span
							>- постоянное чувство усталости, желудочно-кишечные
							заболевания, болезни щитовидной железы,
							сердечно-сосудистые заболевания, астма бронхиальная,
							заболевания печени, гепатиты т д.</span
						><span>-женские заболевания</span
						><span> -мужские заболевания</span
						><span>-эндокринные нарушения </span
						><span>-новообразования</span>
					</div>
					<p>
						Рекомендуется тем, у кого работа связана с вредными
						условиями труда, жителям мегаполиса
					</p>
					<p>
						Рекомендую добавлять в крема тем, у кого стрии (растяжки) на
						коже, добавлять в шампуни, гели, крема, чтобы продлить
						красоту и молодость. Из-за насыщенности минералов хорошо
						применять тем, кто употребляет дистиллированную воду
					</p>
					`,
			},
			"hedge": {
				image: "../images/products/hedge.webp",
				price: 350,
				text: `
					<p>
						<b>Живицa</b> - это кедрoвaя cмола,
						которaя вышла из xвойногo деpeвa ecтecтвeнным путeм, в
						pезультате сокoдвижения в cамом дереве. Можно развести в
						любом масле, например, 5гр живицы и 100мл масла кунжутного.
						Горный Алтай (Онгудай, Белокуриха)
					</p>
					<div class="product__columns">
						<div class="product__column">
							<b
								>Живица в кедровом масле 30% 100мл - 450 ₽
							</b>
							<b>Живица 100% 40гр - 350 ₽</b>
						</div>
					</div>
					<p>
						Кeдровая живица oблaдаeт уникальным xимичecким сoстaвом,
						лeчит мнoжеcтво заболeваний (cеpдечнo-cоcудистыe,
						атероcклеpoз, гипеpтoния, облaдает мощным заживляющим
						эффектом, полезна при ЖКТ (язвы, воспалительные процессы,
						при гепатитах, циррозах печени, гастритах), помогает
						избавить от мышечно-суставных заболеваний, сахарный диабет,
						обладает выраженными антисептическими свойствами (
						всевозможные восполительные процессы в организме,
						туберекулез, кариес, пародонтоз десен, дерматиты, экземы и
						т. д.)
					</p>
					<p>
						Повышает иммунитет, борется с различными инфекционными
						процессами (противовирусные, противобактериальные,
						противогрибковые свойства), снимает усталость и хроническое
						недомогание
					</p>
					<p>
						Устраняет эндокринные нарушения, восстанавливает функцию
						щитовидной железы, способствует женскому и мужскому здоровью
					</p>
					<p>
						Особенно рекомендую жителям мегаполиса, связанные с вредным
						производством, напряженным графиком работы, находящимся на
						вегетарианском питании
					</p>
					<p>
						Живицу можно употреблять во внутрь и наружно, все зависит от
						концентрации и какой эффект и как быстро хотите получить.
					</p>
					<p>
						Живицу можно добавлять в шампуни, в гели. в крема или
						использовать самостоятельно, например, отличный эффект
						-кедровая живица на кедровом масле использовать утром и
						вечером для лица и тела, в отсутствии красителей и
						консервантов, которые образуют пленку на коже и приводят к
						обратному эффекту-старению, натуральный продукт лучше
						всасывается и приносит пользу
					</p>
					`,
			},
			"raw-oil": {
				image: "../images/products/raw-oil.webp",
				price: 400,
				text: `
					<p>
						Предлагаются к продаже масла сыродавленные, изготовляются в
						день заказа, преимущества это свежесть, природный вкус, не
						фильтруются, не подвергаются дополнительной химической
						очистке (большее содержание биологически активных веществ).
						Живое масло не сравниться с маслами, которые предлагаются к
						продаже в магазинах, аптеках или с в наличии, при длительном
						хранении происходит окисление продукта и значительно
						снижаются полезные компоненты.
					</p>
					<p class="article">
						<b
							>- кедровое масло 100мл - 650 ₽, 250мл - 1500 ₽</b
						>
						- рекордсмен по содержанию Вит.Е (все формы альфа, бета,
						гамма), идеальное соотношение1:4 омега 3 к омега 6
					</p>
					<p>
						Масло кедровое индивидуально можно приготовить с живицей,
						что сделает масло более ценным и уникальным продуктом, 2%,
						5%, 10%, 20%, 30%
					</p>
					<p class="article">
						<b>- льняное масло 250мл - 400 ₽</b> -
						повышенное содержание лигнинов, идеальное соотношение 1:4
						омегв3: омега6
					</p>
					<p class="article">
						<b
							>- конопляное масло 100мл - 500₽, 250мл - 1200 ₽</b
						>
						- хлорофилл, иммуноподобные белки (иммуноглобулины),
						идеальное соотношение1:4 омегв3: омега6
					</p>
					<p class="article">
						<b
							>- миндальное 100мл - 700 ₽, 250мл - 1400 ₽,</b
						>
						- содержит амигдалин-витамин В17 (снижает рост
						новообразований)
					</p>
					<p class="article">
						<b
							>- подсолнечное 250мл - 350 ₽, 500мл - 500 ₽</b
						>
						- высокое содержание селена
					</p>
					<p class="article">
						<b
							>- масло черного тмина 250мл - 450 ₽, 500мл - 800
							₽</b
						>
					</p>
					<p class="article">
						<b
							>- масло черного тмина 250мл - 450 ₽, 500мл - 800
							₽</b
						>
					</p>
					<p class="article">
						<b
							>- кунжутное белое 250мл - 550 ₽, черное - 800 ₽</b
						>
						- повышенное содержание Са
					</p>
					<p class="article">
						<b
							>- грецкий орех 100мл - 500 ₽, 250мл - 1100 ₽</b
						>
						- природный антибиотик юглон
					</p>
					<p class="article">
						<b
							>- масло лесного ореха (фундук) 100мл - 400 ₽, 250мл -
							750 ₽</b
						>
					</p>
					<p class="article">
						<b>- арахисовое масло 250мл - 700 ₽</b>
					</p>
					<p class="article">
						<b
							>- масло расторопши 100мл - 350 ₽, 250мл - 700 ₽</b
						>
						- гепатопротектор-силимарин
					</p>
					<p class="article">
						<b
							>-маковое масло 100мл - 400 ₽, 250мл - 850 ₽</b
						>
						- рекордсмен по количеству кальция
					</p>
					<p class="article">
						<b
							>- масло черного тмина 100мл - 950 ₽, 250мл - 1900
							₽</b
						>
					</p>
					<p class="article">
						<b
							>- горчичное масло 100мл - 400 ₽, 250мл - 850 ₽,</b
						>
						- хорошо добавлять в крестоцветные (капуста) для выделения
						сульфорафана и индол-3-карбинола
					</p>
					<p class="article">
						Масла можно добавлять в различные блюда и употреблять как
						самостоятельное средство для лечения и профилактики
						заболеваний, а так же использовать в косметические средства
						шампуни, крема (лифтинг-эффект), но лучше в натуральном
						виде.
					</p>
					`,
			},
			"ghee-oil": {
				image: "../images/products/ghee-oil.webp",
				price: 900,
				text: `
					<p>
					<b>Масло ГХИ</b> содержит короткие
					химические цепочки жирных кислот, полное отсутствие белковой
					фракции (казеина, фермента лактозы и др.), что делает
					продукт очень полезным, не путать с топленым маслом.
				</p>
				<p>
					<b
						>Готовиться под заказ, цена 500гр - 900 ₽</b
					>
				</p>
				<p>
					Содержит витамины А, Е, К, масляную кислоту, является
					пребиотиком (пища для микрофлоры кишечника), полезен при
					дисбактериозе, при желудочно- кишечных проблемах, артритах,
					сахарном диабете, укрепляет костную систему, снижает риск
					развития новообразований
				</p>
				<p>
					Обладает противовоспалительным, ранозаживляющим,
					антиоксидантным действием, повышает иммунитет
				</p>
				<p>
					Отличное средство по уходу за коже, заменяя косметические
					крема.
				</p>
				<p>
					Доставка по регионам России- почтой, все интересующие
					вопросы по телефону или отправтье заявку с вопросом
				</p>
					`,
			},
			"cedar-coffee": {
				image: "../images/products/cedar-coffee.webp",
				price: 350,
				text: `
					<p>
					<b>Кедрокофе </b> - это перемолотые
					цельные кедровые орехи с добавлением молока сухого коровьего
					или кокосового и дополнительных ингредиентов
				</p>
				<p>
					<b>Цена 100гр - 350 ₽</b> Кедрокофе
					изготавливается в день заказа
				</p>
				<p>
					Кедровый орех номер 1 в мире среди орехов, так как содержит
					все заменимые и незаменимые аминокислоты, легкоусвояемый
					белок, практически все витамины, рекордное содержание
					витамина Е , макро и микроэлементы, фитонциды, флавоноиды,
					танины и т.д.
				</p>
				<p>
					Идеальное соотношение 1:4 омега3:омега 6 позволяет снизить в
					организме количество плохого холестерина, хронические
					воспалительные процессы, повысить процессы регенерации,
					заживление ран, укрепить иммунную систему, выравнить
					гормональный фон, улучшить настроение
				</p>
				<p>
					А самое главное все вещества в органической легкоусвояемой
					форме, так как все искусственные аналоги витаминов,
					минералов, омега 3-6-9 -это изомеры, молекулы которых в
					пространстве занимают другое положение, могут только
					навредить организму.
				</p>
				<p>
					Протертая скорлупа тоже очень полезна, она содержит пищевые
					волокна, способствующие улучшению пищеварения. О пользе
					кедрового ореха можно долго писать, просто сделайте выбор в
					его пользу.
				</p>
				<p>
					Для вегетарианцев . спортсменов, детей и подростков кедровый
					орех это продукт номер 1 в питании
				</p>
				<p>
					Основа кедрокофе это цельные кедровые орехи со скорлупой,
					молоко коровье, кокосовое на выбор, плюс добавки по желанию-
					чага, пряности, какао, кофе
				</p>
					`,
			},
			"pine-nut": {
				image: "../images/products/pine-nut.webp",
				price: 250,
				text: `
					<p>
					<b
						>Ядро кедрового ореха в вакуумной упаковке</b
					>, урожай 2020 г., качественный, алтайский
				</p>
				<p>
					<b>100гр - 250 ₽</b>
				</p>
				<p>
					<b>500гр - 750 ₽</b>
				</p>
				<p>
					<b>1кг - 1500 ₽</b>
				</p>
				<p>
					<b>2кг - 1400 ₽</b>, более 2кг - цена
					договорная
				</p>
				<p>
					Кедровый орех номер 1 в мире среди орехов , так как содержит
					все заменимые и незаменимые аминокислоты, легкоусвояемый
					белок, практически все витамины, макро и микроэлементы
				</p>
				<p>
					Идеальное соотношение 1:4 омега3:омега 6 позволяет снизить в
					организме количество плохого холестерина, хронические
					воспалительные процессы, повысить процессы регенерации,
					заживление ран, укрепить иммунную систему, выравнить
					гормональный фон, улучшить настроение
				</p>
				<p>
					А самое главное все вещества в органической легкоусвояемой
					форме, так как все искусственные аналоги витаминов,
					минералов, омега 3-6-9 -это изомеры, молекулы которых в
					пространстве занимают другое положение, могут только
					навредить организму.
				</p>
				<p>
					Так же предлагается другая продукция:
				</p>
				<p>
					<b>- кедровое масло 100мл - 450 ₽ </b
					>отжимается в день заказа
				</p>
				<p>
					<b
						>- кедровые орешки в меде 500гр - 850 ₽</b
					>
				</p>
				<p>
					<b
						>- кедровые орешки в сосновом сиропе 500гр - 850 ₽</b
					>
				</p>
				<p>
					<b
						>- кедровая паста с шоколадом 500гр - 850 ₽</b
					>, готовиться под заказ
				</p>
				<p>
					<b
						>-
						<nuxt-link class="link" to="/products/cedar-coffee"
							>кедрокофе</nuxt-link
						>
						100гр - 250 ₽</b
					>
					по желанию добавляется какао, кофе, кокосовое молоко сухое
					или молоко сухое коровье, готовиться под заказ
				</p>
				<p>
					Протертая скорлупа тоже очень полезна, она содержит пищевые
					волокна, способствующие улучшению пищеварения. О пользе
					кедрового ореха можно долго писать, просто сделайте выбор в
					его пользу.
				</p>
				<p>
					Для вегетарианцев и спортсменов кедровый орех это продукт
					номер 1 в питании.
				</p>
					`,
			},
			"honey": {
				image: "../images/products/honey.webp",
				price: 350,
				text: `
					<p>
					<b>Мёд натуральный качественный</b>,
					Горный Алтай ( Белокуриха)
				</p>
				<p>
					<b>Цветочный, Таежный, Донниковый:</b>
				</p>
				<p>
					<b>Цена за 0,5кг - 350 ₽</b>
				</p>
				<p>
					<b>1кг - 550 ₽</b>
				</p>
				<p>
					<b>2кг - 1050 ₽</b>
				</p>
				<p>
					<b
						>При покупке меда 4,5кг (3л банка) - 1500 ₽ + в подарок
						чай с Горного Алтая 100гр на выбор:<br />
					</b>
					Фруктовый чай, состав: иван-чай, бадан, яблоко, лист
					смородины, душица, лист малины, курильский чай, рябина,
					шиповник.<br />
					Таежный чай, состав: кедровые орешки, смородина, бадан,
					малина, таволга, зверобой, зизифора, кипрей
				</p>
				<p>
					<b>Дягилевый (премиальный) мед: </b>
				</p>
				<p>
					<b>Первая качка - 1кг - 750 ₽</b>
				</p>
				<p>
					<b
						>Вторая качка - 1 кг 650 ₽, 2 кг - 1200 ₽</b
					>
				</p>
				<p>
					<b
						>При покупке меда 4,5кг (3л банка) 2500 ₽ - в подарок
						чай 100гр на выбор(указаны выше).</b
					>
				</p>
				<p>
					Дополнительная продукция:
				</p>
				<p>
					<b
						>Мед с кедровыми орешками 500гр - 550 ₽</b
					>
				</p>
				<p>
					<b
						>Мед с миндальным орехом 500гр - 550 ₽</b
					>
				</p>
				<p>
					<b>Мед с грецким орехом 500гр - 450 ₽</b>
				</p>
				<p>
					<b>Мед с лесным орехом 500гр - 450 ₽</b>
				</p>
				<p>
					<b
						>Мед с брусникой и кедровым орехом 500гр - 650 ₽</b
					>
				</p>
				<p>
					<b
						>Мед с клюквой и кедровым орехом 500гр - 650 ₽</b
					>
				</p>
				<p>
					<b>Крем мед с малиной 250гр - 300 ₽</b>
				</p>
				<p>
					<b>Крем мед с лимоном 250гр - 300 ₽</b>
				</p>
				<p>
					<b>Крем мед с клюквой 250гр - 300 ₽</b>
				</p>
				<p>
					<b
						>Цена 1 мл маточного молочка в мёде 250гр - 1500 ₽, 2мл
						- 1900 ₽</b
					>
					Под заказ
				</p>
				<p>
					<b
						>Мед в бочонках из липы, внутри обработаны воском, цена
						300гр - 750 ₽, 500гр - 950 ₽ - в подарок чай с Горного
						Алтая 50гр</b
					>
				</p>
				<p>
					<b>Отличные подарки на Новый год!</b>
				</p>
				<p>
					<b
						>Мед в бочонках из липы, внутри обработаны воском, цена
						300гр - 750 ₽, 500гр - 950 ₽ - в подарок чай с Горного
						Алтая 50гр</b
					>
				</p>
					`,
			},
			"cream-honey": {
				image: "../images/products/cream-honey.webp",
				price: 250,
				text: `
					<p>
					<b
						>Крем-мед (с малиной, с лимоном, с клюквой)</b
					>,
				</p>
				<p></p>
				<p>
					<b>250гр - 250₽</b>
				</p>
				<p>
					<b>500гр - 550 ₽</b>
				</p>
				<p></p>
					`,
			},
			"premium-honey": {
				image: "../images/products/premium-honey.webp",
				price: 750,
				text: `
					<p>
					<b>Дягилевый мёд</b> с частной пасеки-
					Горный Алтай, Белокуриха, сезон 2020 г.
				</p>
				<p>
					<b>Дягилевый (премиальный) мед: </b>
				</p>
				<p>
					<b>Первая качка - 1кг - 750 ₽</b>
				</p>
				<p>
					<b
						>Вторая качка - 1 кг - 650 ₽, 2 кг - 1200 ₽</b
					>
				</p>
				<p>
					Элитный мед, период цветения непродолжительный, поэтому
					считается эксклюзивным, очень вкусный, вкус карамели с
					шоколадом. Настоящий мед с дягилем медленно кристаллизуется,
					консистенция тягучая, густая.
				</p>
				<p>
					Алтайский мед считается одним из лучших, так как диастаза
					меда около 40 –это показатель биологической активности
					веществ, горные растения активнее равнинных, более богаты
					витаминами, минералами, ферментами и т. д., так как
					находятся в более суровых климатических условиях.
				</p>
				<p>
					Обладает противовоспалительным, противовирусным,
					антибактериальным, иммуномоделирующим, ранозаживляющим,
					регенерирующим, тонизирующим действием.
				</p>
				<p>
					Хорошо использовать в косметических целях.
				</p>
					`,
			},
			"fir-oil": {
				image: "../images/products/fir-oil.webp",
				price: 300,
				text: `
					<p>
					<b>Пихтовое масло</b>
				</p>
				<p>
					<b>40мл - 300 ₽</b>
				</p>
				<p>
					<b>100мл - 500 ₽</b>
				</p>
				<p>
					Гуляя в соcновoм леcу в тeчение часa, можнo не тoлько
					наcытить оpгaнизм кислopoдoм, нo получить бактерицидный
					эффект, тaк как xвоя уничтожает болезнетвoрные
					микроopганизмы.
				</p>
				<p>
					Пиxтовoe мaслo сoдеpжит эфиpные мaсла, теpпентин, cкипидаp,
					дрeвeсный, укcус, вит. C, тaнины, помогаeт борoться c
					воспалительными процессами, авитаминозом, гипоксией,
					улучшить обмен веществ, повышает защитные силы организма.
				</p>
				<p>
					Применяется как тонизирующее, общеукрепляющее.
					бактерицидное, отхаркивающее средство.
				</p>
				<p>
					Помогает при болезнях печени, почек, желудочно-кишечного
					тракта, сердечно-сосудистых, при вирусных инфекциях,
					грибковых.
				</p>
				<p>
					Эффективно применять при массаже, так как улучшает
					кровообращение, для бани, сауны, ванны, в аромалампах, в
					ингаляциях, добавлять в косметические средства-шампуни,
					крема (разглаживает морщины) Можно использовать как
					самостоятельно средство, так и добавлять в различные масла
					(кедровое, персиковое, облепиховое и т.д.
				</p>
					`,
			},
			"production": {
				image: "../images/products/production.webp",
				price: 10,
				text: `
					<p>
						<b>Продукция на основе сосновых зеленых шишек</b>
					</p>
					`,
			},
			"gift-set": {
				image: "../images/products/gift-set.webp",
				price: 2800,
				text: `
					<p>
					<b>Подарочный набор</b> (мед, кедровый
					орех, шишки) из Горного Алтая
				</p>
				<p>
					Предлагается подарочный набор к праздникам и торжествам,
					продукция с Горного Алтая, мед с частной пасеки (
					Белокуриха), деревянный бочонок цельный ( не клееный) из
					липы ручной работы, фруктовый чай или таежный чай-
					индивидуальная, ручная фасовка , очень ароматный (Горный
					Алтай)
				</p>
				<p>Варианты подарочных наборов:</p>
				<p>
					<b>Первый вариант:</b> бочонок деревянный
					из липы, объем <b>0,45мл</b> с медом по
					желанию донниковый, таежный, дягилевый, ядро кедрового ореха
					в вакуумной упаковке <b>100гр</b>,
					зеленые шишки в сосновом сиропе в стеклянной таре
					<b>270мл</b>, фруктовый чай или таежный
					на выбор <b>100гр</b>, новогодняя
					игрушка, деревянная ложка, плетеная корзина, еловая ветка,
					упаковка.
					<b
						>Цена 2800 ₽, с дягилевым медом (мед элитный) 3000
						₽</b
					>
				</p>
				<p>
					<b>Второй вариант:</b> бочонок деревянный
					из липы, объем <b>0,45 мл</b> с медом по
					желанию донниковый, таежный, дягилевый, ядро кедрового ореха
					в вакуумной упаковке <b>100гр</b>,
					натуральные какао бобы с шоколадом
					<b>200 гр</b>, фруктовый чай или таежный
					на выбор <b>100гр</b>, новогодняя
					игрушка, деревянная ложка, плнетеная корзина, еловая ветка,
					упаковка
					<b
						>Цена 2800 ₽, с дягилевым медом 3000 ₽</b
					>
				</p>
				<p>
					<b>Третий вариант:</b> бочонок деревянный
					из липы, объем <b>0,45мл</b> с медом по
					желанию донниковый, таежный, дягилевый, ядро кедрового ореха
					в вакуумной упаковке <b>100гр</b>,
					зеленые шишки в сосновом сиропе в стеклянной таре
					<b>270мл</b>, натуральные какао бобы с
					шоколадом <b>200гр</b>, фруктовый чай или
					таежный чай на выбор 100гр, новогодняя игрушка, деревянная
					ложка, корзина плетеная корзина, еловая ветка, упаковка.
					<b
						>Цена 3200 ₽, с дягилевым медом 3400 ₽</b
					>
				</p>
				<p>
					Бочонок деревянный по желанию можно заменить на бочонок из
					гжели, стоимость подарочного набора будет составлять
					<b>на 250 ₽ дороже</b>
				</p>
				<p>
					<b>Фруктовый чай, состав</b> иван-чай,
					бадан, яблоко, лист смородины, душица, лист малины,
					курильский чай, рябина, шиповник.
				</p>
				<p>
					<b>Таежный чай, состав</b>: кедровые
					орешки, смородина, бадан, малина, таволга, зверобой,
					зизифора, кипрей
				</p>
					`,
			},
			"burdock-juice": {
				image: "../images/products/burdock-juice.webp",
				price: 10,
				text: `
					<p>
					<b>Сок лопуха с медом.</b> Сбор 2020
					года. Место произрастания Горный Алтай. Хранить в
					холодильнике, так как сок живой.
				</p>
				<p>
					Содержит протеины, полезные эфирные масла, высоко содержание
					витамина С, фитонциды и т.д.
				</p>
				<p>
					Лопух применяется как желчегонное, потогонное, диуретическое
					(снимает отеки), отхаркивающее, противоревматическое
					средство, как заживляющее средство (гастриты, язвы) Обладает
					антигипоксическим, антитоксическим, противоинфекционным,
					атеросклеротическим действием, улучшает обмен веществ, из-за
					высокого содержания вещества инулина показан при сахарном
					диабете.
				</p>
				<p>
					Лопух показан при женских и мужских заболеваниях.
				</p>
				<p>
					Обладает иммунопротекторным действием, борется с
					новообразованиями.
				</p>
				<p>
					Можно пить самостоятельно и добавлять в качестве
					дополнительного средства к основному лечению, при приеме
					синтетических препаратов (побочные действия) снижает
					интоксикацию.
				</p>
				<p>
					Сок лопуха можно применять и наружно, добавляя в шампуни и
					крема.
				</p>
					`,
			},
			"cedar-pillows": {
				image: "../images/products/cedar-pillows.webp",
				price: 1000,
				text: `
					<p>
					<b
						>Подушка со скорлупой кедрового ореха</b
					>
					обладает ортопедическим эффектом, жесткая, что стимулирует
					кровообращение, в скорлупе кедровых орехов содержится
					огромное количество полезных веществ, содержащиеся фитонциды
					и эфирные масла препятствуют размножению болезнетворных
					организмов и насекомых, подушка, набитая скорлупой кедровых
					орехов, позволяет:
				</p>
				<p>
					<b
						>Подушки с кедровой скорлупой - 1000 ₽</b
					>
				</p>
				<p>
					<b>Подушки успокаивающие - 1000₽</b>
				</p>
				<p>
					<ul>
						<li><b>- нормализовать кровяное давление</b></li>
						<li><b>- привести в порядок нервную систему</b></li>
						<li><b>- снизить утомляемость</b></li>
						<li><b>- повысить работоспособность</b></li>
					</ul>
				</p>
				<p>
					Сон на кедровой подушке будет спокойным и крепким. Он
					позволит гораздо быстрее восстановить силы. "Кедровый сон"
					поможет улучшить самочувствие
				</p>
				<p>
					<b>Подушка с пленкой ядер кедровых орехов.</b> Подушка не вызывает
					аллергии, не накапливает статическое электричество, имеет
					приятный запах. Подушка обладает и отличными ортопедическими
					свойствами. Упругие свойства наполнителя помогают голове,
					шее, позвоночнику принять наиболее подходящее для сна
					положение.
				</p>
				<p>
					Позволяет хорошо выспаться и даже за короткое время восстановить силы и работоспособность.
				</p>
				<p>
					Тонкий кедровый аромат делает сон  глубоким и спокойным. А фитонциды кедра дарят крепкое здоровье. 
				</p>
				<p>
					Доставка по регионам России- почтой, все интересующие
					вопросы по телефону или отправтье заявку с вопросом
				</p>
					`,
			},
			"royal-jelly": {
				image: "../images/products/royal-jelly.webp",
				price: 1500,
				text: `
					<p>
					<b>Маточное молочко</b> или <b>королевское желе</b> желе - самый ценный из продуктов пчеловодства, содержит более 400 активных биологических веществ, химический состав до сих пор до конца не изучен.
				</p>
				<p>
					<b>1 мл маточного молочка в меде 250гр - 1500 ₽</b> 
				</p>
				<p>
					<b>2мл - 1900₽</b> 
				</p>
				<p>
					Содержит ценные белки, сложные углеводы, липиды, минералы, витамины, гормоны, иммуноглобулины и т. д.
				</p>
				<p>
					Этот уникальный пищевой продукт полезен всем и не имеет противопоказаний.
				</p>
				<p>
					Этот продукт полезен при вирусных, бактериальных заболеваниях, эндокринных нарушениях, повышает женское, мужское здоровье, повышает репродуктивную функцию, иммунитет, помогает устранить все заболевания в организме, устранить хроническую усталость и т. д.
				</p>
				<p>
					Прекрасен в косметических целях.
				</p>
				<p>
					Но чтобы получить его уникальные свойства, максимум биологически активных веществ, есть два варианта:
				</p>
				<p>
					<b>Первый вариант</b> - это получение маточного молочка непосредственно от производителя, находясь на пасеке во время сбора и быстрая заморозка, либо смешивание с медом и хранение в холодильнике
				</p>
				<p>
					<b>Второй вариант</b> - на удаленке заказывать маточное молочко в меде, чтобы пасечник в день заказа смешивал замороженный продукт с медом, это наиболее эффективный способ получить максимум пользы
				</p>
				<p>
					Все остальные варианты в капсулах, в гранулах-продукты переработки (подвергаются выпариванию, термической обработке), в меде разбавленном маточным молочком длительного хранения считаю малоэффективным, снижено количество биологических полезных веществ
				</p>
				<p>
					Предлагается к продаже маточное молочко с Горного Алтая, Район Белокурихи, под заказ (смешивание с медом) в день транспортировки
				</p>
				<p>
					Советую заказывать маленькими порциями, но чаще при необходимости, чтобы сохранять полезные вещества, чем дольше хранение, тем меньше пользы
				</p>
					`,
			},
			"boron-uterus": {
				image: "../images/products/boron-uterus.webp",
				price: 500,
				text: `
					<p>
						<b>Крaсная щетка</b>, cобpанa в Гopнoм
						Алтае, имеет преимущeства перeд aптечнoй( где cыpьe
						хpанитьcя не oдин cезoн), для женскогo и мужскoго здoрoвья,
						cодeржит фитогоpмоны, cпособcтвует уcтpанeнию эндокpинных
						нарушений (кисты миомы зндометриоз, простатит и т. д.),
						восстанавливает репродуктивную функцию организма.
					</p>
					<p>
						<b>Красная щетка 100гр - 500 ₽</b>
					</p>
					<p>
						<b>Боровая матка 100гр - 500 ₽</b>
					</p>
					<p>
						<b>Травяные чаи 100гр - 350 ₽:</b>
						<br><br>
						<b>Таежный</b> с кедровыми орешками, <b>фруктовый</b> с
						ягодами плодами, травами, и другие
					</p>
					<p>
						Обладает противовоспалительным, противоинфекционным,
						антитоксическим ( выводит токсины и радионуклеиды из
						организма) адаптогенным, атеросклеротическим,
						антигипоксическим, омолаживающим, регенерирующим действием.
						Повышает иммунитет. Красная щетка рекомендуется при
						заболеваниях ЖКТ, сердечно- сосудистых. дыхательных систем и
						т. д. Особенно рекомендуется жителям мегаполиса.
					</p>
					<p>
						Трава полезна и женщинам, и мужчинам!
					</p>
					<p>
						При необходимости для лучшего эффекта красную щетку можно
						использовать в комплексе с боровой маткой (синергисты,
						усиливают действие)
					</p>
					<p>
						Предлагаются также боровая матка и другие травяные сборы. По
						желанию можем предоставить фото или видео с места сбора
					</p>
				`,
			},
		},
	}),
	beforeMount() {
		this.product = this.$route.query.name
		this.image = this.products[`${this.product}`].image
		this.price = this.products[`${this.product}`].price
	},
	mounted() {
		this.$refs.text.innerHTML = this.products[`${this.product}`].text
	},
}
</script>

<style lang="sass" scoped>
b
	font-weight: 600
.link
	color: #719c7b
	text-decoration: underline
.main
	margin: 0 auto
	padding-top: 100px
	display: flex
	flex-direction: column
.article
	margin-top: 30px
.bold
	font-weight: 600
.product
	background-color: #efefef
	border-radius: 3px
	width: 100%
	padding: 40px 20px
	margin: 0 auto 140px
	max-width: 1250px
	display: flex
	&__columns
		display: flex
		margin-bottom: 15px
	&__column
		line-height: 1.4em
		display: flex
		flex-direction: column
		&:first-child
			margin-right: 20px
	&__image
		width: 270px
		background-position: center center
		margin-bottom: 20px
		border-radius: 3px
		background-size: cover
		height: 350px
	&__price
		display: flex
		justify-content: center
		align-items: center
		margin-bottom: 8px
		border: #000 solid 1px
		border-radius: 3px
		height: 35px
		min-width: 270px
		max-width: 100%
		font-size: 13px
		font-weight: 600
		background-color: #fff
		transition: all 300ms ease 0s
		&:hover
			border: #fff solid 1px
			background-color: #000
			color: #fff
	&__text
		text-align: justify
		line-height: 1.2em
		p
			margin-bottom: 20px
@media screen and ( max-width: 767px)
	.product
		flex-direction: column
		&__column
			align-items: center
			margin-right: 0 !important
			margin-bottom: 20px
</style>
